-- phpMyAdmin SQL Dump
-- version 4.4.15.7
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 02 2017 г., 17:29
-- Версия сервера: 5.5.50
-- Версия PHP: 5.4.45

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `tms2`
--

-- --------------------------------------------------------

--
-- Структура таблицы `crm_forum`
--

CREATE TABLE IF NOT EXISTS `crm_forum` (
  `id` bigint(20) NOT NULL,
  `name` text NOT NULL,
  `description` text NOT NULL,
  `forum_id` bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `crm_otdel`
--

CREATE TABLE IF NOT EXISTS `crm_otdel` (
  `id_otdel` int(11) NOT NULL,
  `name` varchar(200) NOT NULL,
  `function` varchar(1000) NOT NULL,
  `id_otdel_papa` int(11) NOT NULL,
  `cvet` enum('синий (анализ, управление)','оранжевый(инфраструктура,интеграция)','малиновый (маркетинг, продажи, реклама)','красный (финансы)','зеленый (производство, разработки)','серый (качество)','желтый ( PR, связи с общественностью )') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `crm_otdel`
--

INSERT INTO `crm_otdel` (`id_otdel`, `name`, `function`, `id_otdel_papa`, `cvet`) VALUES
(1, 'Отдел Продаж', 'эффективно обрабатывать поступающие заявки, проводить переговоры с заключением договоров ', 3, 'малиновый (маркетинг, продажи, реклама)'),
(3, 'Бюро переводов RTT', '', 3, 'синий (анализ, управление)'),
(4, 'Отдел Маркетинга', 'Производство и распространение качественных маркетинговых материалов', 3, 'малиновый (маркетинг, продажи, реклама)'),
(5, 'Отдел Рекламы', 'Разработка рекламных компаний и проведение рекламных компаний, приводящих клиентов', 3, 'малиновый (маркетинг, продажи, реклама)'),
(6, 'Отдел Переводов', 'Обеспечивать качественный перевод документов', 3, 'зеленый (производство, разработки)'),
(7, 'Отдел Верстки', 'Обеспечивать качественную верстку документов', 3, 'зеленый (производство, разработки)'),
(8, 'Отдел Качества', 'Контроль за качеством исполнеия своей работы различными отделами', 3, 'серый (качество)'),
(9, ' Отдел PR и связей с общественностью', '', 3, 'желтый ( PR, связи с общественностью )');

-- --------------------------------------------------------

--
-- Структура таблицы `crm_projects`
--

CREATE TABLE IF NOT EXISTS `crm_projects` (
  `id_project` bigint(20) NOT NULL,
  `name` text,
  `full_name` text NOT NULL,
  `otv_ruk` bigint(20) DEFAULT NULL,
  `date_generate` datetime NOT NULL,
  `date_start` datetime NOT NULL,
  `date_end` datetime NOT NULL,
  `teh_zad` text NOT NULL,
  `id_otdel` int(11) NOT NULL,
  `sostoyanie` enum('планируется достичь','в работе','достигнуто') NOT NULL,
  `current-task-number` int(11) DEFAULT NULL,
  `creator_id` bigint(20) NOT NULL
) ENGINE=MyISAM AUTO_INCREMENT=25 DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `crm_projects`
--

INSERT INTO `crm_projects` (`id_project`, `name`, `full_name`, `otv_ruk`, `date_generate`, `date_start`, `date_end`, `teh_zad`, `id_otdel`, `sostoyanie`, `current-task-number`, `creator_id`) VALUES
(8, 'Заработать 100 тысяч', 'ST ooo', 91, '2017-05-03 17:16:58', '2017-05-03 17:17:02', '0000-00-00 00:00:00', '', 1, 'достигнуто', 0, 91),
(9, 'Провести контекстную рекламу РТТ на 50 с помощью купонов', 'UUU pro', 101, '2017-05-03 17:17:43', '2017-05-03 17:17:49', '2017-05-03 17:17:50', '', 1, 'достигнуто', 0, 91),
(10, 'Улучшить контент 4-х групп в основных социальных сетях', 'ы334', 101, '2017-05-04 09:22:17', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '', 1, 'в работе', 2, 91),
(7, 'Разработать и снять 5 видеоинтервью со Светланой Васяниной Бюро переводов как Человек дела', 'RRTT inc', 91, '2017-05-03 17:16:40', '2017-05-03 17:30:38', '0000-00-00 00:00:00', '', 1, 'достигнуто', 3, 91),
(11, 'Маркетинг план по onlinegitara.ru', 'фыыфы', 91, '2017-05-04 14:58:57', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '', 1, 'в работе', 11, 91),
(12, 'Разработать и внедрить TMS в кооператива RTT', '', 125, '2017-05-05 14:55:15', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '', 1, 'в работе', 14, 91),
(13, 'Изучить разработку статичных сайтов', '', 101, '2017-05-10 12:18:58', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '', 1, 'в работе', 1, 101),
(14, 'Прочитать книгу "Управление проектами"', '', 125, '2017-05-10 17:22:04', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '', 1, 'в работе', 2, 91),
(15, 'Создание сайта по копирайту, презентации и видео', '', 125, '2017-05-10 18:00:01', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '', 1, 'в работе', 3, 125),
(16, 'Разработать и внедрить TMS в кооператива RTT', '', 125, '2017-05-10 18:15:21', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '', 1, 'в работе', 1, 125),
(17, 'TRREEE', 'цель TREE', NULL, '2017-05-12 17:09:10', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '2222', 1, 'планируется достичь', 0, 125),
(18, 'QQQQzzz', '', 91, '2017-05-12 17:34:08', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '', 1, 'планируется достичь', 0, 115),
(19, '22222', '', NULL, '2017-05-12 17:56:46', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '', 1, 'планируется достичь', 0, 125);

-- --------------------------------------------------------

--
-- Структура таблицы `crm_tasks`
--

CREATE TABLE IF NOT EXISTS `crm_tasks` (
  `id_task` bigint(20) NOT NULL,
  `name` text,
  `vhod_dannye` text NOT NULL,
  `vihod_resultat` text NOT NULL,
  `upravlenie` text NOT NULL,
  `resursy_spisok` text NOT NULL,
  `proj_id` bigint(20) DEFAULT NULL,
  `vazhnost` enum('не очень важная','важная','очень важная') DEFAULT NULL,
  `srochnost` enum('несрочная (недели)','срочная (дни)','очень срочная (часы)') DEFAULT NULL,
  `otv_sotr` bigint(20) DEFAULT NULL,
  `sostoyanie_zadachi` enum('план','в работе','закончена','принята') DEFAULT NULL,
  `date_plan` datetime NOT NULL,
  `date_start` datetime DEFAULT NULL,
  `data_zaversheniya` datetime NOT NULL,
  `data_prinyatiya` datetime NOT NULL,
  `number_task` int(11) NOT NULL,
  `creator_id` bigint(20) NOT NULL
) ENGINE=MyISAM AUTO_INCREMENT=85 DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `crm_tasks`
--

INSERT INTO `crm_tasks` (`id_task`, `name`, `vhod_dannye`, `vihod_resultat`, `upravlenie`, `resursy_spisok`, `proj_id`, `vazhnost`, `srochnost`, `otv_sotr`, `sostoyanie_zadachi`, `date_plan`, `date_start`, `data_zaversheniya`, `data_prinyatiya`, `number_task`, `creator_id`) VALUES
(27, 'Задача1', 'выавыа', 'ц цуйцу', '', '', 8, 'не очень важная', 'несрочная (недели)', 101, 'принята', '2017-05-03 17:28:12', '2017-05-03 17:28:39', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 91),
(28, 'Хтту', 'каку куп', 'пуп еу', '', '', 8, 'не очень важная', 'несрочная (недели)', 91, 'план', '2017-05-03 17:28:34', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 91),
(36, '2772727', '', '', '', '', 11, 'не очень важная', 'несрочная (недели)', 91, 'в работе', '2017-05-05 09:27:05', '2017-05-18 10:58:57', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 1, 91),
(50, 'ZZXX', '', '', '', '', 11, 'не очень важная', 'несрочная (недели)', 101, 'план', '2017-05-05 18:06:48', '2017-05-18 10:58:17', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 1, 91),
(31, 'фвывывфы', '', '', '', '', 8, 'не очень важная', 'несрочная (недели)', 91, 'в работе', '2017-05-04 14:52:59', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 91),
(33, 'УУУУУ', '', '', '', '', 8, 'не очень важная', 'несрочная (недели)', 91, 'план', '2017-05-04 16:16:44', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 91),
(34, 'RRRRWWW', '', '', '', '', 8, 'не очень важная', 'несрочная (недели)', 91, 'план', '2017-05-04 16:19:13', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 0, 101),
(51, 'RRRR1', 'GGGG', '', '', '', 11, 'не очень важная', 'несрочная (недели)', 91, 'план', '2017-05-05 18:09:17', '2017-05-18 10:58:31', '0000-00-00 00:00:00', '2017-05-18 10:58:23', 2, 91),
(49, 'QQQx', 'QQQa', 'qwqw', '', '', 7, 'не очень важная', 'несрочная (недели)', 101, 'план', '2017-05-05 17:42:42', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 2, 91),
(48, 'GGG', 'GGGy', 'daa', '', '', 7, 'не очень важная', 'несрочная (недели)', 91, 'в работе', '2017-05-05 17:42:21', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 1, 91),
(52, 'NNNN', 'ZZzza', '', '', '', 11, 'не очень важная', 'несрочная (недели)', 91, 'в работе', '2017-05-05 18:11:53', '2017-05-18 10:59:17', '0000-00-00 00:00:00', '2017-05-18 10:58:25', 3, 101),
(53, 'VVV', 'vvv', '', '', '', 11, 'не очень важная', 'несрочная (недели)', 91, 'план', '2017-05-05 18:12:43', '2017-05-18 10:58:08', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 4, 91),
(54, 'Qqqq', 'Xccc', '', '', '', 11, 'не очень важная', 'несрочная (недели)', 91, 'в работе', '2017-05-05 18:30:47', '2017-05-18 10:59:22', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 5, 91),
(55, 'Vvvvv', 'Vvvv', '', '', '', 11, 'не очень важная', 'несрочная (недели)', 91, 'в работе', '2017-05-05 18:34:09', '2017-05-18 10:59:20', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 6, 91),
(56, 'axsa', 'saxasx', '', '', '', 11, 'не очень важная', 'несрочная (недели)', 91, 'план', '2017-05-05 18:39:47', '2017-05-18 10:58:13', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 7, 91),
(57, 'Ewwwew', 'wewe', '', '', '', 11, 'не очень важная', 'несрочная (недели)', 91, 'в работе', '2017-05-05 18:42:20', '2017-05-18 10:59:25', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 8, 91),
(58, 'ЦЦЦЦЦ ккккк', 'цвцу цуцу', '', '', '', 11, 'не очень важная', 'несрочная (недели)', 91, 'в работе', '2017-05-10 10:27:38', '2017-05-18 10:59:28', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 9, 91),
(59, '@@@@', '121212', '', '', '', 7, 'не очень важная', 'несрочная (недели)', 125, 'в работе', '2017-05-10 17:02:01', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 3, 101),
(60, 'SSqqq', 'aqqa', '', '', '', 13, 'не очень важная', 'несрочная (недели)', NULL, 'план', '2017-05-10 17:03:41', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 1, 101),
(61, 'Aqqq', 'Входные данные', 'Выходной результат	', 'Управление', 'Ресурсы список', 10, 'не очень важная', 'несрочная (недели)', 120, 'в работе', '2017-05-10 17:03:53', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 1, 101),
(62, 'ed3ddee', '', '', '', '', 16, 'не очень важная', 'несрочная (недели)', NULL, 'план', '2017-05-10 18:35:43', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 1, 125),
(63, 'edwder', '', '', '', '', 15, 'не очень важная', 'несрочная (недели)', NULL, 'план', '2017-05-10 18:35:49', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 1, 125),
(64, '@121221', '', '', '', '', 15, 'не очень важная', 'несрочная (недели)', 120, 'в работе', '2017-05-10 18:35:55', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 2, 125),
(65, '21w2121', '2ereA', '', '', '', 14, 'не очень важная', 'несрочная (недели)', 91, 'план', '2017-05-10 18:36:12', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 1, 125),
(66, 'wee', 'xdwerer', 'wewewe', '', '', 12, 'не очень важная', 'несрочная (недели)', 121, 'закончена', '2017-05-10 18:36:31', '2017-05-12 18:36:31', '2017-05-15 16:26:31', '2017-05-15 14:26:31', 1, 125),
(67, 'qweqweqwe', '', '', '', '', 14, 'не очень важная', 'несрочная (недели)', 91, 'план', '2017-05-10 18:44:03', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 2, 125),
(82, 'VVVVVVV', 'WWWWW', '', '', '', 12, 'не очень важная', 'несрочная (недели)', 91, 'в работе', '2017-05-17 15:38:07', '2017-05-17 17:58:11', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 12, 91),
(81, 'asdas', 'addЫЫЫЫ', 'ыыыы', 'фыфЫ', 'ФЫФыф', 10, 'не очень важная', 'несрочная (недели)', 91, 'план', '2017-05-12 16:32:07', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 2, 91),
(78, 'Rrrr', 'Zzzzz', '', '', '', 12, 'не очень важная', 'несрочная (недели)', 121, 'закончена', '2017-05-11 18:23:03', '2017-05-13 18:23:03', '2017-05-17 18:09:36', '2017-05-16 17:09:33', 11, 121),
(79, '2d2sd2', '', '', '', '', 15, 'не очень важная', 'несрочная (недели)', NULL, 'план', '2017-05-12 11:18:04', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 3, 91),
(80, 'r3223', 'e323', '', '', '', 11, 'не очень важная', 'несрочная (недели)', NULL, 'план', '2017-05-12 12:44:21', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 11, 91),
(77, 'Wwwe', 'Gggg', '', '', '', 12, 'не очень важная', 'несрочная (недели)', 121, 'в работе', '2017-05-13 12:21:49', '2017-05-13 18:21:49', '0000-00-00 00:00:00', '0000-00-00 00:00:00', 10, 121),
(83, 'w1s111', '', '', '', '', 12, 'не очень важная', 'несрочная (недели)', 91, 'принята', '2017-05-17 17:05:04', '2017-05-17 17:06:04', '0000-00-00 00:00:00', '2017-05-17 17:53:05', 13, 91),
(84, '`1`1`1`1', '', '', '', '', 12, 'не очень важная', 'несрочная (недели)', NULL, 'план', '2017-05-17 17:55:03', NULL, '0000-00-00 00:00:00', '0000-00-00 00:00:00', 14, 91);

-- --------------------------------------------------------

--
-- Структура таблицы `crm_workers`
--

CREATE TABLE IF NOT EXISTS `crm_workers` (
  `id` int(11) NOT NULL,
  `number` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `fio` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `fio_eng` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `position` enum('Админ','Старший менеджер','Менеджер','Сотрудник') COLLATE utf8_bin NOT NULL,
  `city` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `address1` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `address2` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `mail1` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `mail2` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `phone1` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `phone2` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `phone3` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `responsibility` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `login` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `password` varchar(255) COLLATE utf8_bin NOT NULL DEFAULT '',
  `is_arhiv` tinyint(4) NOT NULL DEFAULT '0',
  `level` tinyint(4) NOT NULL,
  `token` text COLLATE utf8_bin NOT NULL
) ENGINE=MyISAM AUTO_INCREMENT=129 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `crm_workers`
--

INSERT INTO `crm_workers` (`id`, `number`, `fio`, `fio_eng`, `position`, `city`, `address1`, `address2`, `mail1`, `mail2`, `phone1`, `phone2`, `phone3`, `responsibility`, `login`, `password`, `is_arhiv`, `level`, `token`) VALUES
(91, '', 'Васянин Александр', 'VVP', 'Админ', 'Moscow', '', '', '', '', '', '', '', '', 'adm', 'adm', 0, 3, '557af5165f7075baa7150cc8fcdf2457'),
(101, '', 'Светлана Викторовна', '', 'Старший менеджер', '', '', '', '', '', '', '', '', '', 'styke', 'styketms', 0, 3, ''),
(115, '', 'ЦуууГыыы', '', 'Менеджер', '', '', '', '', '', '', '', '', '', 'cygynder', '54321', 0, 0, ''),
(120, '', 'Ыыы', '', 'Менеджер', '', '', '', '', '', '', '', '', '', 'bro', 'bro', 0, 0, ''),
(121, '', 'Сотр1', '', 'Сотрудник', '', '', '', 'erre', '', '', '', '', '', 'sotr1', '123456', 0, 0, ''),
(124, '', 'Костин Костя Костевич', 'Kostya', 'Менеджер', '', '', '', '', '', '', '', '', '', 'kostya', 'kostya', 1, 0, ''),
(125, '', 'TREE', 'TREE', 'Менеджер', '2333', 'wwww', 'qqqq', '', '', '', '', '', '', 'tree', 'tree', 0, 0, ''),
(127, '1', 'DREE', 'DREE', 'Менеджер', '', '', '', '', '', '', '', '', '', 'dree', 'dree', 1, 0, ''),
(128, '', 'SSDD', '', 'Админ', '', '', '', '', '', '', '', '', '', 'ssd', 'ssd', 0, 0, '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `crm_forum`
--
ALTER TABLE `crm_forum`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `crm_projects`
--
ALTER TABLE `crm_projects`
  ADD PRIMARY KEY (`id_project`);

--
-- Индексы таблицы `crm_tasks`
--
ALTER TABLE `crm_tasks`
  ADD PRIMARY KEY (`id_task`);

--
-- Индексы таблицы `crm_workers`
--
ALTER TABLE `crm_workers`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `crm_forum`
--
ALTER TABLE `crm_forum`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT для таблицы `crm_projects`
--
ALTER TABLE `crm_projects`
  MODIFY `id_project` bigint(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=25;
--
-- AUTO_INCREMENT для таблицы `crm_tasks`
--
ALTER TABLE `crm_tasks`
  MODIFY `id_task` bigint(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=85;
--
-- AUTO_INCREMENT для таблицы `crm_workers`
--
ALTER TABLE `crm_workers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=129;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
